tutorials/scalarTransportFoam/prism/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

//These vertices define the block below. It envelopes the stl files. The block can be even bigger than the stl files
//Watch out if the stl files are created in mm or m!

vertices
(
	( 0 0 0 ) //0
	( 1 0 0 ) //1
	( 1 2 0 ) //2
	( 0 2 0 ) //3
	( 0 0 1 ) //4
	( 1 0 1 ) //5
	( 1 2 1 ) //6
	( 0 2 1 ) //7
				
);

blocks
( 
	hex (0 1 2 3 4 5 6 7) (8 16 8) simpleGrading (1 1 1)
);

edges();

boundary
(
	inlet
	    {
	        type patch;
	        faces
	        (
	            (0 1 5 4)
	        );
	    }
	outlet
	    {
	        type patch;
	        faces
	        (
	            (3 2 6 7)
	        );
	    }
	walls
	    {
	        type patch;
	        faces
	        (
				(1 2 6 5)
				(4 5 6 7)
				(0 4 7 3)
				(0 3 2 1)
	        );
	    }

);

// ************************************************************************* //
